Задача 58: Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц.
Например, даны 2 матрицы:
2 4 | 3 4
3 2 | 3 3
Результирующая матрица будет:
18 20
15 18
=============================================================================================

Данная программа создает две матрицы matrix1 и matrix2 и инициализирует их значениями. Затем программа проверяет, можно ли умножить эти матрицы, сравнивая количество столбцов первой матрицы с количеством строк второй матрицы. Если умножение невозможно, программа выводит сообщение об ошибке и завершает работу. Если умножение возможно, программа создает результирующую матрицу result и выполняет умножение матриц. Для этого используется вложенный цикл for. После умножения матриц программа выводит результирующую матрицу на консоль с помощью цикла for 
Для создания двумерных массивов в C# используется ключевое слово new и оператор [,]. В данной программе массивы инициализируются значениями при объявлении. Для проверки возможности умножения матриц используется условный оператор if. Если умножение невозможно, программа выводит сообщение об ошибке с помощью метода Console.WriteLine и завершает работу с помощью оператора return. Если умножение возможно, программа создает результирующую матрицу с помощью ключевого слова new и выполняет умножение матриц с помощью вложенных циклов for. Для вывода результирующей матрицы на консоль используется вложенный цикл for 
