Задача 62. Напишите программу, которая заполнит спирально массив 4 на 4.
Например, на выходе получается вот такой массив:
01 02 03 04
12 13 14 05
11 16 15 06
10 09 08 07
==================================================================================

 Код начинается с использования директивы  using System; , которая позволяет программе использовать классы и методы из пространства имен  System . 
-  class Program  определяет класс с именем  Program . 
-  static void Main()  является точкой входа в программу. 
- Внутри метода  Main  определяется размер массива  n  и создается двумерный массив  array  размером  n  на  n , который будет заполняться спирально. 
- Затем код инициализирует переменные  value ,  startX ,  startY ,  endX  и  endY , которые будут использоваться для определения границ заполняемой области. 
- Далее следует цикл, который заполняет массив спирально. В каждой итерации цикла заполняется одна сторона спирали: сначала вправо, затем вниз, влево и вверх. При этом значение  value  увеличивается с каждой итерацией. 
- После заполнения массива программа выводит его на экран. Внешний цикл перебирает строки массива, а внутренний цикл перебирает столбцы. Каждый элемент массива выводится с помощью  Console.Write  с форматированием  {array[i, j]:D2} , чтобы элементы были выровнены по ширине и имели два символа. 
